AuditLogs
| where OperationName has "Update application – Certificates and secrets management"
| extend ['Actor IP Address'] = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
| extend Actor = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| extend ['Target Application Name'] = tostring(TargetResources[0].displayName)
| extend ['Target Application ObjectId'] = tostring(TargetResources[0].id)
| where isnotempty(Actor)
| project TimeGenerated, OperationName, Actor, ['Actor IP Address'], ['Target Application Name'], ['Target Application ObjectId']
